[
  {
    "Id": 1,
    "Type": "Footwear",
    "Brand": "FloraRun",
    "Name": "Blossom Running Shoes",
    "Description": "The Blossom Running Shoes by FloraRun combine style and performance with breathable mesh fabric in soft pink and floral accents. A cushioned sole ensures comfort on every stride.",
    "Price": 89.99
  },
  {
    "Id": 2,
    "Type": "Apparel",
    "Brand": "ElegantMiles",
    "Name": "Lilac Breeze Running Jacket",
    "Description": "Run comfortably on cooler days with the Lilac Breeze Running Jacket. It’s wind-resistant, lightweight, and has a flattering fit.",
    "Price": 79.99
  },  
  {
    "Id": 3,
    "Type": "Footwear",
    "Brand": "PacePetal",
    "Name": "Cherry Blossom Trainers",
    "Description": "Experience comfort and charm with the Cherry Blossom Trainers. These lightweight shoes feature a petal-inspired tread for enhanced grip.",
    "Price": 84.99
  },
  {
    "Id": 4,
    "Type": "Apparel",
    "Brand": "VelvetStride",
    "Name": "Sunset Gradient Tank Top",
    "Description": "Stay cool with the Sunset Gradient Tank Top, featuring a breathable, quick-dry fabric and a stunning pink-to-orange gradient design.",
    "Price": 34.99
  },
  {
    "Id": 5,
    "Type": "Electronics",
    "Brand": "RunSmart",
    "Name": "BlushFit Heart Rate Monitor",
    "Description": "Track your heart rate in style with the BlushFit Heart Rate Monitor. It features a sleek design and integrates seamlessly with your running app.",
    "Price": 59.99
  },
  {
    "Id": 6,
    "Type": "Nutrition",
    "Brand": "GlowFuel",
    "Name": "Berry Bliss Energy Gel",
    "Description": "Fuel your runs with the Berry Bliss Energy Gel, packed with natural electrolytes and a refreshing mixed-berry flavor.",
    "Price": 2.99
  },
  {
    "Id": 7,
    "Type": "Apparel",
    "Brand": "GraceRun",
    "Name": "Petal Performance Leggings",
    "Description": "Run in style with the Petal Performance Leggings. Designed with moisture-wicking fabric and floral patterns, these leggings offer both comfort and elegance.",
    "Price": 49.99
  },
  {
    "Id": 8,
    "Type": "Bags",
    "Brand": "TrailEssence",
    "Name": "Blush Belt Pack",
    "Description": "The Blush Belt Pack is a sleek and practical way to carry your essentials. Its water-resistant design and vibrant rose color make it a runner’s favorite.",
    "Price": 24.99
  },
  {
    "Id": 9,
    "Type": "Accessories",
    "Brand": "RunChic",
    "Name": "Rosy Reflective Armband",
    "Description": "Stay visible during nighttime runs with the Rosy Reflective Armband. It features a vibrant pink hue and an adjustable strap for a snug fit.",
    "Price": 19.99
  },
  {
    "Id": 10,
    "Type": "Footwear",
    "Brand": "GlamSprint",
    "Name": "SparkleStride Sneakers",
    "Description": "Make a statement with the SparkleStride Sneakers. These shoes feature glitter detailing and a supportive midsole for ultimate style and performance.",
    "Price": 99.99
  },
  {
    "Id": 11,
    "Type": "Accessories",
    "Brand": "PinkPower",
    "Name": "Rose Quartz Water Bottle",
    "Description": "Stay hydrated with the Rose Quartz Water Bottle. It’s BPA-free, insulated, and features an elegant pink finish.",
    "Price": 24.99
  }
]
